; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-3-2-3-5-5-5) (:domain depots)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 truck2 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 - Pallet
	crate0 crate1 crate2 crate3 crate4 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate3)
	(at pallet1 depot1)
	(clear crate4)
	(at pallet2 depot2)
	(clear crate1)
	(at pallet3 distributor0)
	(clear crate2)
	(at pallet4 distributor1)
	(clear crate0)
	(at truck0 depot1)
	(at truck1 depot0)
	(at truck2 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at crate0 distributor1)
	(on crate0 pallet4)
	(at crate1 depot2)
	(on crate1 pallet2)
	(at crate2 distributor0)
	(on crate2 pallet3)
	(at crate3 depot0)
	(on crate3 pallet0)
	(at crate4 depot1)
	(on crate4 pallet1)
)

(:goal (and
		(on crate0 pallet4)
		(on crate2 crate3)
		(on crate3 pallet3)
		(on crate4 crate0)
	)
))

; plan
1. (lift hoist3 crate2 pallet3 distributor0)
   deleted: (at crate2 distributor0) (available hoist3) (on crate2 pallet3) (clear crate2)
   added: (lifting hoist3 crate2) (clear pallet3)
   goals met: 1 of 4
2. (load hoist3 crate2 truck2 distributor0)
   deleted: (lifting hoist3 crate2)
   added: (in crate2 truck2) (available hoist3)
   goals met: 1 of 4
3. (lift hoist0 crate3 pallet0 depot0)
   deleted: (at crate3 depot0) (available hoist0) (on crate3 pallet0) (clear crate3)
   added: (lifting hoist0 crate3) (clear pallet0)
   goals met: 1 of 4
4. (load hoist0 crate3 truck1 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck1) (available hoist0)
   goals met: 1 of 4
5. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 1 of 4
6. (unload hoist3 crate3 truck1 distributor0)
   deleted: (available hoist3) (in crate3 truck1)
   added: (lifting hoist3 crate3)
   goals met: 1 of 4
7. (lift hoist1 crate4 pallet1 depot1)
   deleted: (at crate4 depot1) (available hoist1) (on crate4 pallet1) (clear crate4)
   added: (lifting hoist1 crate4) (clear pallet1)
   goals met: 1 of 4
8. (load hoist1 crate4 truck0 depot1)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   goals met: 1 of 4
9. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 1 of 4
10. (drop hoist3 crate3 pallet3 distributor0)
   deleted: (lifting hoist3 crate3) (clear pallet3)
   added: (at crate3 distributor0) (available hoist3) (on crate3 pallet3) (clear crate3)
   goals met: 2 of 4
11. (unload hoist3 crate2 truck2 distributor0)
   deleted: (available hoist3) (in crate2 truck2)
   added: (lifting hoist3 crate2)
   goals met: 2 of 4
12. (drop hoist3 crate2 crate3 distributor0)
   deleted: (lifting hoist3 crate2) (clear crate3)
   added: (at crate2 distributor0) (available hoist3) (on crate2 crate3) (clear crate2)
   goals met: 3 of 4
13. (unload hoist4 crate4 truck0 distributor1)
   deleted: (available hoist4) (in crate4 truck0)
   added: (lifting hoist4 crate4)
   goals met: 3 of 4
14. (drop hoist4 crate4 crate0 distributor1)
   deleted: (lifting hoist4 crate4) (clear crate0)
   added: (at crate4 distributor1) (available hoist4) (on crate4 crate0) (clear crate4)
   goals met: 4 of 4
